---
kind: other
id: Properties.T:Autodesk.Revit.DB.Mechanical.MechanicalSystem
source: html/8d0be6ad-456a-5e3b-8d05-8140f5068422.htm
---
# MechanicalSystem Properties

The id of the assembly instance to which the element belongs.